app/views/resources/_form.html.erb

SELECT "options".* FROM "options" WHERE (question_id = 18)
---
        <%= form.label q.descripition %>
        <% @options = Option.where('question_id = ?', q.id) %>

SELECT "questions".* FROM "questions" WHERE (group_id = 4)
---
        <% else %>
          <%= form.select "question[#{q.id}]", @options.collect { |option| [option.description, option.description] },{prompt: '(Selecione a opção)'}, class: 'form-control' %>

SELECT "payments".* FROM "payments"
---
    <%= form.label 'Principal forma de recebimento deste produto' %>
    <%= form.select :payment_id, Payment.all.collect { |pay| [pay.descrition, pay.id] },{prompt: '(Selecione a forma de pagamento)'}, class: 'form-control' %>