app/controllers/business_processes_controller.rb

SELECT "questions".* FROM "questions" WHERE (group_id = 3)
---
  def new
    @answer = Answer.new
    @questions = Question.where('group_id = 3')

INSERT INTO "answers" ("answer", "created_at", "updated_at", "question_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", ""], ["created_at", "2019-05-09 01:25:18.802840"], ["updated_at", "2019-05-09 01:25:18.802840"], ["question_id", 13], ["user_id", 2]]
---
  def create
    params[:business_process][:question].each do |k, v|
      answer = Answer.new
      answer.user_id = params[:business_process][:user_id]
      answer.question_id = k;
      answer.answer = v;
      answer.save