app/controllers/businesses_controller.rb

SELECT "questions".* FROM "questions" WHERE (group_id = 2)
---
  def new
    @answer = Answer.new
    @questions = Question.where('group_id = 2')

INSERT INTO "answers" ("answer", "created_at", "updated_at", "question_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", ""], ["created_at", "2019-05-09 00:44:34.080314"], ["updated_at", "2019-05-09 00:44:34.080314"], ["question_id", 8], ["user_id", 2]]
---
  def create
    params[:business][:question].each do |k, v|
      answer = Answer.new
      answer.user_id = params[:business][:user_id]
      answer.question_id = k;
      answer.answer = v;
      answer.save