app/controllers/competitivenesses_controller.rb

  def new
    @answer = Answer.new
    @questions = Question.where('group_id = 5')
---
SELECT "questions".* FROM "questions" WHERE (group_id = 5)

  def create
    params[:competitiveness][:question].each do |k, v|
      answer = Answer.new
      answer.user_id = params[:competitiveness][:user_id]
      answer.question_id = k;
      answer.answer = v;
      answer.save
---
INSERT INTO "answers" ("answer", "created_at", "updated_at", "question_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", ""], ["created_at", "2019-05-09 01:25:29.448633"], ["updated_at", "2019-05-09 01:25:29.448633"], ["question_id", 21], ["user_id", 2]]