app/controllers/contextualizations_controller.rb

SELECT "questions".* FROM "questions" WHERE (group_id = 1)
---
  def new
    @answer = Answer.new
    @questions = Question.where('group_id = 1')

INSERT INTO "answers" ("answer", "created_at", "updated_at", "question_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", "a"], ["created_at", "2019-04-25 01:09:33.018326"], ["updated_at", "2019-04-25 01:09:33.018326"], ["question_id", 1], ["user_id", 1]]
---
  def create
    params[:contextualization][:question].each do |k, v|
      answer = Answer.new
      answer.user_id = params[:contextualization][:user_id]
      answer.question_id = k;
      answer.answer = v;
      answer.save