app/controllers/finances_controller.rb

SELECT "questions".* FROM "questions" WHERE (group_id = 7)
SELECT "answers".* FROM "answers" WHERE (user_id = 2)
---
  def index
    @finances = Question.where('group_id = 7')
    @answer = Answer.where('user_id = ?', current_user.id)

SELECT "questions".* FROM "questions" WHERE (group_id = 7)
---
  def new
    @answer = Answer.new
    @questions = Question.where('group_id = 7')

INSERT INTO "answers" ("answer", "created_at", "updated_at", "question_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", "100"], ["created_at", "2019-04-25 01:26:32.503566"], ["updated_at", "2019-04-25 01:26:32.503566"], ["question_id", 30], ["user_id", 1]]
---
  def create
    params[:finance][:question].each do |k, v|
      answer = Answer.new
      answer.user_id = params[:finance][:user_id]
      answer.question_id = k;
      answer.answer = v;
      answer.save