app/controllers/fixed_costs_controller.rb

  def index
    @fixed_costs = FixedCost.where('user_id = ?', current_user.id)
---
SELECT "fixed_costs".* FROM "fixed_costs" WHERE (user_id = 2)

  def new
    @fixed_cost = FixedCost.where('user_id = ?', current_user.id).limit(1)
    if (@fixed_cost.blank?)
---
SELECT  "fixed_costs".* FROM "fixed_costs" WHERE (user_id = 2) LIMIT $1  [["LIMIT", 1]]

  def create
    @fixed_cost = FixedCost.new(fixed_cost_params)

    respond_to do |format|
      if @fixed_cost.save
---
INSERT INTO "fixed_costs" ("water", "light", "telephone", "counter", "vehicle", "officeSupplies", "rental", "maintenance", "taxes", "other", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

    def set_fixed_cost
      @fixed_cost = FixedCost.find(params[:id])
---
SELECT  "fixed_costs".* FROM "fixed_costs" WHERE "fixed_costs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]