app/controllers/human_resources_controller.rb

  def new
    @answer = Answer.new
    @questions = Question.where('group_id = 10')
---
SELECT "questions".* FROM "questions" WHERE (group_id = 10)

  def create
    params[:human_resource][:question].each do |k, v|
      answer = Answer.new
      answer.user_id = params[:human_resource][:user_id]
      answer.question_id = k;
      answer.answer = v;
      answer.save
---
INSERT INTO "answers" ("answer", "created_at", "updated_at", "question_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", ""], ["created_at", "2019-05-09 00:46:06.313661"], ["updated_at", "2019-05-09 00:46:06.313661"], ["question_id", 46], ["user_id", 2]]