app/controllers/marketings_controller.rb

  def new
    @answer = Answer.new
    @questions = Question.where('group_id = 6')
---
SELECT "questions".* FROM "questions" WHERE (group_id = 6)

  def create
    params[:marketing][:question].each do |k, v|
      answer = Answer.new
      answer.user_id = params[:marketing][:user_id]
      answer.question_id = k;
      answer.answer = v;
      answer.save
---
INSERT INTO "answers" ("answer", "created_at", "updated_at", "question_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", ""], ["created_at", "2019-05-09 01:25:31.901539"], ["updated_at", "2019-05-09 01:25:31.901539"], ["question_id", 27], ["user_id", 2]]