app/controllers/pricings_controller.rb

SELECT "questions".* FROM "questions" WHERE (group_id = 8)
---
  def new
    @answer = Answer.new
    @questions = Question.where('group_id = 8')

INSERT INTO "answers" ("answer", "created_at", "updated_at", "question_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", "Curto prazo"], ["created_at", "2019-05-09 01:30:01.273369"], ["updated_at", "2019-05-09 01:30:01.273369"], ["question_id", 34], ["user_id", 2]]
---
  def create
    params[:pricing][:question].each do |k, v|
      answer = Answer.new
      answer.user_id = params[:pricing][:user_id]
      answer.question_id = k;
      answer.answer = v;
      answer.save