app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (user_id = 2)
---
  def index
    @products = Product.where('user_id = ?', current_user.id)

INSERT INTO "products" ("description", "cost", "freightCost", "freightSale", "commission", "tax", "quantity", "profit", "created_at", "updated_at", "user_id", "payment_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save