app/controllers/resources_controller.rb

  def index
    @resources = Question.where('group_id = 4')
    @answer = Answer.where('user_id = ?', current_user.id)
---
SELECT "questions".* FROM "questions" WHERE (group_id = 4)
SELECT "answers".* FROM "answers" WHERE (user_id = 2)

  def new
    @answer = Answer.new
    @questions = Question.where('group_id = 4')
---
SELECT "questions".* FROM "questions" WHERE (group_id = 4)

  def create
    params[:resource][:question].each do |k, v|
      answer = Answer.new
      answer.user_id = params[:resource][:user_id]
      answer.question_id = k;
      answer.answer = v;
      answer.save
---
INSERT INTO "answers" ("answer", "created_at", "updated_at", "question_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["answer", ""], ["created_at", "2019-05-09 01:25:24.973428"], ["updated_at", "2019-05-09 01:25:24.973428"], ["question_id", 18], ["user_id", 2]]