app/views/products/_form.html.erb

    <%= form.label 'Principal forma de recebimento deste produto' %>
    <%= form.select :payment_id, Payment.all.collect { |pay| [pay.descrition, pay.id] },{prompt: '(Selecione a forma de pagamento)'}, class: 'form-control' %>
---
SELECT "payments".* FROM "payments"